In [1]:
import pandas as pd

In [2]:
dict_eg = {'Integer': [1,2,3,4,5],
          'Greek': ['alpha', 'beta','gamma',
                   'delta', 'epsilon']}

In [3]:
df_from_dict = pd.DataFrame(data=dict_eg)

In [4]:
df_from_dict

   Integer    Greek
0        1    alpha
1        2     beta
2        3    gamma
3        4    delta
4        5  epsilon

In [5]:
df_from_dict2 = df_from_dict.set_index('Integer')

In [6]:
df_from_dict2

           Greek
Integer
1          alpha
2           beta
3          gamma
4          delta
5        epsilon

In [7]:
list_fruites = [['apple', 11],
               ['banana', 22],
               ['cherry', 33],
               ['durian', 44]]

In [8]:
df_list1 = pd.DataFrame(list_fruites)

In [9]:
df_list1

        0   1
0   apple  11
1  banana  22
2  cherry  33
3  durian  44

In [10]:
df_list1.set_axis(['a', 'b', 'c', 'd'], axis='index')

        0   1
a   apple  11
b  banana  22
c  cherry  33
d  durian  44

In [11]:
df_list1.set_axis(["Fruit", "Number"], axis='columns')

    Fruit  Number
0   apple      11
1  banana      22
2  cherry      33
3  durian      44

In [12]:
df_list2 = pd.DataFrame(list_fruites,
                       columns=["Fruit", "Number"],
                       index=['a', 'b', 'c', 'd'])

In [13]:
df_list2

    Fruit  Number
a   apple      11
b  banana      22
c  cherry      33
d  durian      44